### Forest: Lotus Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.lotus-mainnet.data.digitalocean_project.forest_project: Reading...
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.lotus-mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=2c0c6c15-2864-11ee-96cf-0a58ac14d28d]
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/4003270040538543685]
module.lotus-mainnet.digitalocean_droplet.forest: Refreshing state... [id=366853533]
module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=366853533-2c0c6c15-2864-11ee-96cf-0a58ac14d28d-20230725073507573600000001]
module.lotus-mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=0234c809-e0ab-460e-afd3-12d892147158]
module.lotus-mainnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.lotus-mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lotus-mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-07-25T07:34:05Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "366853533" -> (known after apply)
      ~ ipv4_address         = "104.248.244.226" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.7" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "lotus"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:366853533" -> (known after apply)
      ~ user_data            = "3afd0ac3f2f79a5aa377ab3dd73d0238d5f1f28f" -> "48926826daa53160ca6da59341b4c70718aedc13" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [
          - "2c0c6c15-2864-11ee-96cf-0a58ac14d28d",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lotus-mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 366853533,
        ] -> (known after apply)
        id              = "0234c809-e0ab-460e-afd3-12d892147158"
        name            = "mainnet-calibnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lotus-mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:366853533",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 366853533 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "366853533-2c0c6c15-2864-11ee-96cf-0a58ac14d28d-20230725073507573600000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>